(function() {
		function removeMenus() {
			$('.m-select').removeClass('m-focus').find('dd').hide();
		};
		var SelectorJS = { 		 
			age: function(age0, age1, val0, val1) {
				function getAgeHTML(start) {
					start = start || 16;
					start = start > 70 ? 70 : start;
					var result = '',
						i = start;
					for (; i <= 70; i++) {
						result += '<a  href="javascript:;" val="' + i + '">' + i + '</a>';
					}
					return result;
				}
				new SelectorJS.selector.init({
					id: age0,
					data: getAgeHTML(),
					value: val0,
					click: function(value) {
						var prev = $('dt', age1).html() | 0;
						var form = new SelectorJS.selector.init({
							id: age1,
							value: value >= prev ? value : prev,
							data: getAgeHTML(value + 1)
						});
						if (value >= prev) {
							form.curValue.html(value + 1 < 71 ? value + 1 : 70)
						}
						form.curValue.click();
					}
				}).curValue.html(val0);
				new SelectorJS.selector.init({
					id: age1,
					value: val1,
					data: getAgeHTML(val0 + 1)
				}).curValue.html(val1);
			}, 
			selector: {
				init: function(options) {
					this.select = $(options.id);
					this.data = options.data;
					this.value = options.value;
					this.height = options.height;
					this.width = options.width;
					this.curValue = this.select.find('dt');
					this.list = this.select.find('dd');
					this.input = this.select.find('input');
					this.click = options.click;

					this.height && this.list.css({
						height: this.height,
						overflowY: 'auto'
					});
					this.width && this.select.css({
						width: this.width
					});

					this.create = function() {
						var listHTML = '',
							that = this;
						if (typeof this.data !== 'string') {
							$.each(this.data, function(index, val) {
								if (val[0] == that.value) {
									that.input.val(val[0]);
									that.curValue.html(val[1]);
								}
								listHTML += '<a val="' + val[0] + '" href="javascript:;">' + val[1] + '</a>';
							});
						} else {
							listHTML = this.data;
						}
						this.list.children().not('input').remove();
						this.list.append(listHTML);
						if (this.data !== 'string') {
							//that.input.val(this.value);
							//that.curValue.html(this.value);
						}
					},
					this.events = function() {
						var that = this;
						this.list.find('a').bind('click', function(e) {
							e.stopPropagation();
							that.input.val($(this).attr('val'));
							that.curValue.html($(this).text());
							that.list.hide();
							that.select.removeClass('m-focus');
							that.click && that.click.call(this, $(this).attr('val') | 0, $(this).index());
						});
						$(document).unbind('click', removeMenus)
							.bind('click', removeMenus);
						this.select.bind('click', function(e) {
							e.stopPropagation();
							removeMenus();
							that.list.show();
							that.select.addClass('m-focus');
						});
					}

					this.create();
					this.events();
				}
			} 
	}; window.SelectorJS = SelectorJS;
})();

var areCode_广东 = [ ["广州", "广州"], ["深圳", "深圳"], ["珠海", "珠海"], ["汕头", "汕头"], ["韶关", "韶关"], ["河源", "河源"], ["梅州", "梅州"], ["惠州", "惠州"], ["汕尾", "汕尾"], ["东莞", "东莞"], ["中山", "中山"], ["江门", "江门"], ["佛山", "佛山"], ["阳江", "阳江"], ["湛江", "湛江"], ["茂名", "茂名"], ["肇庆", "肇庆"], ["清远", "清远"], ["潮州", "潮州"], ["揭阳", "揭阳"], ["云浮", "云浮"], ["", ""]];
var areCode_广西 = [ ["南宁", "南宁"], ["柳州", "柳州"], ["桂林", "桂林"], ["梧州", "梧州"], ["北海", "北海"], ["防城港", "防城港"], ["钦州", "钦州"], ["贵港", "贵港"], ["玉林", "玉林"], ["百色", "百色"], ["贺州", "贺州"], ["河池", "河池"], ["来宾", "来宾"], ["崇左", "崇左"]];
var areCode_北京 = [ ["东城区", "东城区"], ["西城区", "西城区"], ["崇文区", "崇文区"], ["宣武区", "宣武区"], ["朝阳区", "朝阳区"], ["丰台区", "丰台区"], ["石景山区", "石景山区"], ["海淀区", "海淀区"], ["门头沟区", "门头沟区"], ["房山区", "房山区"], ["通州区", "通州区"], ["顺义区", "顺义区"], ["昌平区", "昌平区"], ["大兴区", "大兴区"], ["怀柔区", "怀柔区"], ["平谷区", "平谷区"], ["密云县", "密云县"], ["延庆区", "延庆区"], ["", ""]];
var areCode_海南 = [ ["海口", "海口"], ["三亚", "三亚"], ["其它", "其它"]];
var areCode_福建 = [ ["福州", "福州"], ["厦门", "厦门"], ["三明", "三明"], ["莆田", "莆田"], ["泉州", "泉州"], ["漳州", "漳州"], ["南平", "南平"], ["龙岩", "龙岩"], ["宁德", "宁德"]];
var areCode_天津 = [ ["和平区", "和平区"], ["河东区", "河东区"], ["河西区", "河西区"], ["南开区", "南开区"], ["河北区", "河北区"], ["红桥区", "红桥区"], ["塘沽区", "塘沽区"], ["汉沽区", "汉沽区"], ["大港区", "大港区"], ["东丽区", "东丽区"], ["西青区", "西青区"], ["津南区", "津南区"], ["北辰区", "北辰区"], ["武清区", "武清区"], ["宝坻区", "宝坻区"], ["宁河区", "宁河区"], ["静海县", "静海县"], ["蓟县", "蓟县"]];
var areCode_湖南 = [ ["长沙", "长沙"], ["株洲", "株洲"], ["湘潭", "湘潭"], ["衡阳", "衡阳"], ["邵阳", "邵阳"], ["岳阳", "岳阳"], ["常德", "常德"], ["张家界", "张家界"], ["益阳", "益阳"], ["郴州", "郴州"], ["永州", "永州"], ["怀化", "怀化"], ["娄底", "娄底"], ["湘西", "湘西"]];
var areCode_湖北 = [ ["武汉", "武汉"], ["黄石", "黄石"], ["襄樊", "襄樊"], ["十堰", "十堰"], ["荆州", "荆州"], ["宜昌", "宜昌"], ["荆门", "荆门"], ["鄂州", "鄂州"], ["孝感", "孝感"], ["黄冈", "黄冈"], ["咸宁", "咸宁"], ["随州", "随州"], ["恩施", "恩施"]];
var areCode_河南 = [ ["郑州", "郑州"], ["开封", "开封"], ["洛阳", "洛阳"], ["平顶山", "平顶山"], ["焦作", "焦作"], ["鹤壁", "鹤壁"], ["新乡", "新乡"], ["安阳", "安阳"], ["濮阳", "濮阳"], ["许昌", "许昌"], ["漯河", "漯河"], ["三门峡", "三门峡"], ["南阳", "南阳"], ["商丘", "商丘"], ["信阳", "信阳"], ["周口", "周口"], ["驻马店", "驻马店"], ["济源", "济源"], ["其它", "其它"]];
var areCode_河北 = [ ["石家庄", "石家庄"], ["唐山", "唐山"], ["秦皇岛", "秦皇岛"], ["邯郸", "邯郸"], ["邢台", "邢台"], ["保定", "保定"], ["张家口", "张家口"], ["承德", "承德"], ["沧州", "沧州"], ["廊坊", "廊坊"], ["衡水", "衡水"]];
var areCode_山东 = [ ["济南", "济南"], ["青岛", "青岛"], ["淄博", "淄博"], ["枣庄", "枣庄"], ["东营", "东营"], ["潍坊", "潍坊"], ["烟台", "烟台"], ["威海", "威海"], ["济宁", "济宁"], ["泰安", "泰安"], ["日照", "日照"], ["莱芜", "莱芜"], ["临沂", "临沂"], ["德州", "德州"], ["聊城", "聊城"], ["滨州", "滨州"], ["菏泽", "菏泽"]];
var areCode_山西 = [ ["太原", "太原"], ["大同", "大同"], ["阳泉", "阳泉"], ["长治", "长治"], ["晋城", "晋城"], ["朔州", "朔州"], ["晋中", "晋中"], ["运城", "运城"], ["忻州", "忻州"], ["临汾", "临汾"], ["吕梁", "吕梁"]];
var areCode_黑龙江 = [ ["哈尔滨", "哈尔滨"], ["齐齐哈尔", "齐齐哈尔"], ["鹤岗", "鹤岗"], ["双鸭山", "双鸭山"], ["鸡西", "鸡西"], ["大庆", "大庆"], ["伊春", "伊春"], ["牡丹江", "牡丹江"], ["佳木斯", "佳木斯"], ["七台河", "七台河"], ["黑河", "黑河"], ["绥化", "绥化"], ["大兴安岭", "大兴安岭"]];
var areCode_辽宁 = [ ["沈阳", "沈阳"], ["大连", "大连"], ["鞍山", "鞍山"], ["抚顺", "抚顺"], ["本溪", "本溪"], ["丹东", "丹东"], ["锦州", "锦州"], ["葫芦岛", "葫芦岛"], ["营口", "营口"], ["盘锦", "盘锦"], ["阜新", "阜新"], ["辽阳", "辽阳"], ["铁岭", "铁岭"], ["朝阳", "朝阳"]];
var areCode_上海 = [ ["黄浦区", "黄浦区"], ["卢湾区", "卢湾区"], ["徐汇区", "徐汇区"], ["长宁区", "长宁区"], ["静安区", "静安区"], ["普陀区", "普陀区"], ["闸北区", "闸北区"], ["虹口区", "虹口区"], ["杨浦区", "杨浦区"], ["宝山区", "宝山区"], ["闵行区", "闵行区"], ["嘉定区", "嘉定区"], ["浦东新区", "浦东新区"], ["金山区", "金山区"], ["松江区", "松江区"], ["青浦区", "青浦区"], ["南汇区", "南汇区"], ["奉贤区", "奉贤区"], ["崇明县", "崇明县"]];
var areCode_甘肃 = [ ["兰州", "兰州"], ["金昌", "金昌"], ["白银", "白银"], ["天水", "天水"], ["嘉峪关", "嘉峪关"], ["武威", "武威"], ["张掖", "张掖"], ["平凉", "平凉"], ["酒泉", "酒泉"], ["庆阳", "庆阳"], ["定西", "定西"], ["陇南", "陇南"], ["甘南", "甘南"], ["临夏", "临夏"]];
var areCode_青海 = [ ["西宁", "西宁"], ["海东", "海东"], ["海北", "海北"], ["黄南", "黄南"], ["海南", "海南"], ["果洛", "果洛"], ["玉树", "玉树"], ["海西", "海西"]];
var areCode_新疆 = [ ["乌鲁木齐", "乌鲁木齐"], ["克拉玛依", "克拉玛依"], ["石河子", "石河子"], ["吐鲁番", "吐鲁番"], ["哈密", "哈密"], ["和田", "和田"], ["阿克苏", "阿克苏"], ["喀什", "喀什"], ["克孜勒苏", "克孜勒苏"], ["巴音郭楞", "巴音郭楞"], ["昌吉", "昌吉"], ["博尔塔拉", "博尔塔拉"], ["伊犁", "伊犁"], ["塔城", "塔城"], ["阿勒泰", "阿勒泰"]];
var areCode_西藏 = [ ["拉萨", "拉萨"], ["那曲", "那曲"], ["昌都", "昌都"], ["山南", "山南"], ["日喀则", "日喀则"], ["阿里", "阿里"], ["林芝", "林芝"]];
var areCode_宁夏 = [ ["银川", "银川"], ["石嘴山", "石嘴山"], ["吴忠", "吴忠"], ["固原", "固原"]];
var areCode_四川 = [ ["成都", "成都"], ["自贡", "自贡"], ["攀枝花", "攀枝花"], ["泸州", "泸州"], ["德阳", "德阳"], ["绵阳", "绵阳"], ["广元", "广元"], ["遂宁", "遂宁"], ["内江", "内江"], ["乐山", "乐山"], ["南充", "南充"], ["宜宾", "宜宾"], ["广安", "广安"], ["达州", "达州"], ["眉山", "眉山"], ["雅安", "雅安"], ["巴中", "巴中"], ["资阳", "资阳"], ["阿坝", "阿坝"], ["甘孜", "甘孜"], ["凉山", "凉山"]];
var areCode_云南 = [ ["昆明", "昆明"], ["曲靖", "曲靖"], ["玉溪", "玉溪"], ["保山", "保山"], ["昭通", "昭通"], ["思茅", "思茅"], ["临沧", "临沧"], ["丽江", "丽江"], ["文山", "文山"], ["红河", "红河"], ["西双版纳", "西双版纳"], ["楚雄", "楚雄"], ["大理", "大理"], ["德宏", "德宏"], ["怒江", "怒江"], ["迪庆", "迪庆"]];
var areCode_吉林 = [ ["长春", "长春"], ["吉林", "吉林"], ["四平", "四平"], ["辽源", "辽源"], ["通化", "通化"], ["白山", "白山"], ["松原", "松原"], ["白城", "白城"], ["延边", "延边"]];
var areCode_内蒙古 = [ ["呼和浩特", "呼和浩特"], ["包头", "包头"], ["乌海", "乌海"], ["赤峰", "赤峰"], ["通辽", "通辽"], ["鄂尔多斯", "鄂尔多斯"], ["呼伦贝尔", "呼伦贝尔"], ["乌兰察布", "乌兰察布"], ["锡林郭勒", "锡林郭勒"], ["巴彦淖尔", "巴彦淖尔"], ["阿拉善", "阿拉善"], ["兴安", "兴安"]];
var areCode_陕西 = [ ["西安", "西安"], ["铜川", "铜川"], ["宝鸡", "宝鸡"], ["咸阳", "咸阳"], ["渭南", "渭南"], ["延安", "延安"], ["汉中", "汉中"], ["榆林", "榆林"], ["安康", "安康"], ["商洛", "商洛"]];
var areCode_安徽 = [ ["合肥", "合肥"], ["芜湖", "芜湖"], ["蚌埠", "蚌埠"], ["淮南", "淮南"], ["马鞍山", "马鞍山"], ["淮北", "淮北"], ["铜陵", "铜陵"], ["安庆", "安庆"], ["黄山", "黄山"], ["滁州", "滁州"], ["阜阳", "阜阳"], ["宿州", "宿州"], ["巢湖", "巢湖"], ["六安", "六安"], ["毫州", "毫州"], ["池州", "池州"], ["宣城", "宣城"]];
var areCode_贵州 = [ ["贵阳", "贵阳"], ["六盘水", "六盘水"], ["遵义", "遵义"], ["安顺", "安顺"], ["铜仁", "铜仁"], ["毕节", "毕节"], ["黔西南", "黔西南"], ["黔东南", "黔东南"], ["黔南", "黔南"]];
var areCode_江苏 = [ ["南京", "南京"], ["徐州", "徐州"], ["连云港", "连云港"], ["淮安", "淮安"], ["宿迁", "宿迁"], ["盐城", "盐城"], ["扬州", "扬州"], ["泰州", "泰州"], ["南通", "南通"], ["镇江", "镇江"], ["常州", "常州"], ["无锡", "无锡"], ["苏州", "苏州"]];
var areCode_重庆 = [ ["渝中区", "渝中区"], ["大渡口", "大渡口"], ["江北区", "江北区"], ["沙坪坝", "沙坪坝"], ["九龙坡", "九龙坡"], ["南岸区", "南岸区"], ["北碚区", "北碚区"], ["万盛区", "万盛区"], ["双桥区", "双桥区"], ["渝北区", "渝北区"], ["巴南区", "巴南区"], ["万州区", "万州区"], ["涪陵区", "涪陵区"], ["黔江区", "黔江区"], ["长寿区", "长寿区"], ["江津区", "江津区"], ["合川区", "合川区"], ["永川区", "永川区"], ["南川区", "南川区"], ["綦江县", "綦江县"], ["潼南县", "潼南县"], ["铜梁县", "铜梁县"], ["大足县", "大足县"], ["荣昌县", "荣昌县"], ["壁山县", "壁山县"], ["垫江县", "垫江县"], ["武隆县", "武隆县"], ["丰都县", "丰都县"], ["城口县", "城口县"], ["梁平县", "梁平县"], ["开县", "开县"], ["巫溪县", "巫溪县"], ["巫山县", "巫山县"], ["奉节县", "奉节县"], ["云阳县", "云阳县"], ["忠县", "忠县"], ["石柱", "石柱"], ["彭水", "彭水"], ["酉阳", "酉阳"], ["秀山", "秀山"]];
var areCode_浙江 = [ ["杭州", "杭州"], ["宁波", "宁波"], ["温州", "温州"], ["嘉兴", "嘉兴"], ["湖州", "湖州"], ["绍兴", "绍兴"], ["金华", "金华"], ["衢州", "衢州"], ["舟山", "舟山"], ["台州", "台州"], ["丽水", "丽水"]];
var areCode_江西 = [ ["南昌", "南昌"], ["景德镇", "景德镇"], ["萍乡", "萍乡"], ["九江", "九江"], ["新余", "新余"], ["鹰潭", "鹰潭"], ["赣州", "赣州"], ["吉安", "吉安"], ["宜春", "宜春"], ["抚州", "抚州"], ["上饶", "上饶"]];
var areCode_台湾 = [ ["台北", "台北"], ["高雄", "高雄"], ["台中", "台中"], ["台南", "台南"], ["基隆", "基隆"], ["新竹", "新竹"]];
var areCode_香港 = [ ["香港", "香港"]];
var areCode_澳门 = [ ["澳门", "澳门"]];
var areCode_国外 = [ ["亚洲", "亚洲"], ["欧洲", "欧洲"], ["南美洲", "南美洲"], ["北美洲", "北美洲"], ["非洲", "非洲"], ["大洋洲", "大洋洲"]];


   $(function(){

    var ZCDetail=(function(){
        return {
            init:function(){
                this.bindEvent();
            	  	 
            },  
            bindEvent:function(){ 

	                $("#zzstart a").click(function(){ 
						      $("#s2").val("");
	                    var s1val = $("#s1").val(); 
	                  var codename = eval("areCode_"+s1val); 
	                  $(".detail-bottommenu").show();
	                    //按钮可以点
	                      new SelectorJS.selector.init({
								        id:'#zzend',
								        data: codename,
								        value:'请选择'
								      });  
	                });
	                
	                $("#ptss").click(function(){ 
	                	var s11 = $("#s11").val();
	                	if(s11 == null || s11 == ""){
	                	 alert("请选择地区");
	                	 return ;
	                	}
	                	youkeSearch.submit(); 
	                });
	                
	                $("#zzend").click(function(){ 
	                	$(".detail-bottommenu").hide();
	                });
	                
	                $("#zzstart").click(function(){ 
	                	 $(".detail-bottommenu").hide();
	                });
	               
	                $("#agestart").click(function(){ 
	                	$(".detail-bottommenu").hide();
	                });
	                
	                $("#ageend").click(function(){ 
	                	$(".detail-bottommenu").hide();
	                });
	                
	                $(document).ready(function(){
	                	  $(document).mousemove(function(e){
	                		  $(".detail-bottommenu").show();
	                	  });
	                	});
	                
	                $("#gjss").click(function(){ 
	                	 alert("您是游客，请先注册或登陆！");
	                     location.href = "./reg.jsp";
	                		return;
	                });
	                $("#hyss").click(function(){ 
	                	alert("您是普通会员，请升级后使用本功能！");
	                     location.href = "./paymoney.jsp";
	                     return;
	                });
	                $("#vipss").click(function(){ 
	                	var s1 = $("#s1").val();
	                	var s2 = $("#s2").val();
	                	if(s1 == null || s1 == ""){
		                	 alert("请选择省份");
		                	 return ;
		                	}
	                	if(s2 == null || s2 == ""){
		                	 alert("请选择市区");
		                	 return ;
		                	}
                		personal.submit(); 
                   });
            }
        }
    })();
    ZCDetail.init();

});
   
 //性别
   new SelectorJS.selector.init({
     id:'#sex1',
     data: [["0", "不限"], ["10", "男"], ["11", "女"] ],
     value:'0'
   });  

   //婚否
   new SelectorJS.selector.init({
     id:'#Marriage1',
     data: [["0", "不限"], ["10", "未婚"], ["11", "已婚"], ["12", "单身"] ],
     value:'0'
   });
   
    //地区
   new SelectorJS.selector.init({
     id:'#area1',
     data: [["", "请选择"],["北京", "北京"], ["天津", "天津"], ["河北", "河北"], ["山西", "山西"], ["内蒙古", "内蒙古"], ["辽宁", "辽宁"], ["吉林", "吉林"], ["黑龙江", "黑龙江"], ["上海", "上海"], ["江苏", "江苏"], ["浙江", "浙江"], ["安徽", "安徽"], ["福建", "福建"], ["江西", "江西"], ["山东", "山东"], ["河南", "河南"], ["湖北", "湖北"], ["湖南", "湖南"], ["广东", "广东"], ["广西", "广西"], ["海南", "海南"], ["重庆", "重庆"], ["四川", "四川"], ["贵州", "贵州"], ["云南", "云南"], ["西藏", "西藏"], ["陕西", "陕西"], ["甘肃", "甘肃"], ["青海", "青海"], ["宁夏", "宁夏"], ["新疆", "新疆"] , ["香港", "香港"] , ["澳门", "澳门"] , ["台湾", "台湾"] , ["国外", "国外"] ],
     value:''
   });
   
    //照片
   new SelectorJS.selector.init({
     id:'#photo1',
     data: [["0", "不限"], ["1", "有"], ["2", "无"] ],
     value:'0'
   });
  //验证
   new SelectorJS.selector.init({
     id:'#isvcation1',
     data: [["", "不限"],["1", "已验证"], ["0", "未验证"] ],
     value:''
   });
  
   
 //性别    
   new SelectorJS.selector.init({
           id:'#sex2',
           data: [["0", "不限"], ["10", "男"], ["11", "女"] ],
           value:'0'
         });  
    
   //婚否      
   new SelectorJS.selector.init({
           id:'#Marriage2',
           data: [["0", "不限"], ["10", "未婚"], ["11", "已婚"], ["12", "单身"] ],
           value:'0'
         });

   //照片
   new SelectorJS.selector.init({
       id:'#photo2',
       data: [["0", "不限"], ["1", "有"], ["2", "无"] ],
       value:'0'
     });

   //目的
   new SelectorJS.selector.init({
       id:'#jyyx',
       data: [["0", "不限"], ["1", "纯友谊"], ["2", "亲密关系"], ["3", "婚 姻"], ["4", "陪伴"], ["5", "其它"] ],
       value:'0'
     });

   //年龄
   new SelectorJS.age('#agestart','#ageend',24,28);

   //学历
   new SelectorJS.selector.init({
       id:'#whcd',
       data: [["0", "不限"], ["12", "高中/中专及以下"], ["13", "大学/大专"], ["14", "硕士研究生"], ["15", "博士研究生及以上"] ],
       value:'0'
     });

   //职业
   new SelectorJS.selector.init({
     id:'#zy',
     data: [["0", "不限"], ["10", "专家技术人员"], ["11", "单位负责人"], ["12", "办事人员"], ["13", "销售服务业"], ["14", "农林牧渔水利业"], ["15", "生产运输业"], ["16", "军人"], ["17", "其他"] ],
     value:'0'
   });

   //血型
   new SelectorJS.selector.init({
     id:'#sx',
     data: [["0", "不限"], ["10", "A型"], ["11", "B型"], ["12", "AB型"], ["13", "O型"] ],
     value:'0'
   });

   //星座
   new SelectorJS.selector.init({
     id:'#xz',
     data: [["0", "不限"], ["10", "白羊座"], ["11", "双子座"], ["12", "金牛座"], ["13", "巨蟹座"], ["14", "狮子座"], ["15", "处女座"], ["16", "天秤座"], ["17", "天蝎座"], ["18", "射手座"], ["19", "魔羯座"], ["20", "双鱼座"], ["21", "水瓶座"] ],
     value:'0'
   });
    
   //身高
   new SelectorJS.selector.init({
     id:'#sg',
     data: [["0", "不限"], ["10", "145cm以下"], ["11", "145-150cm"], ["12", "150-155cm"], ["13", "155-160cm"], ["14", "160-165cm"], ["15", "165-170cm"], ["16", "170-175cm"], ["17", "175-180cm"], ["18", "180-185cm"], ["19", "185cm以上"] ],
     value:'0'
   });

   //体重
   new SelectorJS.selector.init({
     id:'#tz',
     data: [["0", "不限"], ["12", "90斤以下"], ["13", "90-100斤"], ["14", "100-110斤"], ["15", "110-120斤"], ["16", "120-130斤"], ["17", "130-140斤"], ["18", "140-150斤"], ["19", "150-160斤"] ],
     value:'0'
   });

   //肤色
   new SelectorJS.selector.init({
     id:'#fs',
     data: [["0", "不限"], ["10", "白皙"], ["11", "一般"], ["12", "偏黑"] ],
     value:'0'
   });

   //年薪
   new SelectorJS.selector.init({
     id:'#user_income',
     data: [["0", "不限"], ["10", "年收入:2万元以下"], ["11", "年收入:2-5万元"], ["12", "年收入:5-10万元"], ["13", "年收入:10-100万元"], ["14", "年收入:100万元以上"] ],
     value:'0'
   });

   //住房
   new SelectorJS.selector.init({
     id:'#zf',
     data: [["0", "不限"], ["10", "自有住房"], ["11", "同父母合住"], ["12", "在外租房"] ],
     value:'0'
   });

   //住址
   new SelectorJS.selector.init({
           id:'#zzstart',
           data: [["", "请选择"],["北京", "北京"], ["天津", "天津"], ["河北", "河北"], ["山西", "山西"], ["内蒙古", "内蒙古"], ["辽宁", "辽宁"], ["吉林", "吉林"], ["黑龙江", "黑龙江"], ["上海", "上海"], ["江苏", "江苏"], ["浙江", "浙江"], ["安徽", "安徽"], ["福建", "福建"], ["江西", "江西"], ["山东", "山东"], ["河南", "河南"], ["湖北", "湖北"], ["湖南", "湖南"], ["广东", "广东"], ["广西", "广西"], ["海南", "海南"], ["重庆", "重庆"], ["四川", "四川"], ["贵州", "贵州"], ["云南", "云南"], ["西藏", "西藏"], ["陕西", "陕西"], ["甘肃", "甘肃"], ["青海", "青海"], ["宁夏", "宁夏"], ["新疆", "新疆"] ],
           value:''
         });
  //验证
   new SelectorJS.selector.init({
     id:'#isvcation',
     data: [["", "不限"],["1", "已验证"], ["0", "未验证"] ],
     value:''
   });

         
